src/DataProcessors/ГрафикРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ГрафикРаботыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ГрафикРаботыСотрудников/Forms/ФормаПодбораИнтерваловВремени/Ext/Form/Module.bsl
&НаКлиенте
Перем ВремяНачалоПред; // Перем - Хранение пред. времени начала работы
&НаКлиенте
Перем ВремяОкончанияПред; // Перем - Хранение пред. времени окончания работы

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтервалыРаботы = Неопределено;
	Параметры.Свойство("ДатаДня"        , ДатаДня);
	Параметры.Свойство("ИнтервалыРаботы", ИнтервалыРаботы);

	СтруктурнаяЕдиница            = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ВремяРаботыСтруктурнойЕдиницы = Новый ФиксированныйМассив(Справочники.СтруктурныеЕдиницы.РабочиеДниСтруктурнойЕдиницы(СтруктурнаяЕдиница));
	
	// Заполнение списка интервалов времени
	Если ЗначениеЗаполнено(ДатаДня) Тогда		
		
		ЭлементМассиваДней = Неопределено;
		Для Каждого ЭлементМ ИЗ ВремяРаботыСтруктурнойЕдиницы Цикл
			Если ДеньНедели(ЭлементМ.ДеньНедели) = ДеньНедели(ДатаДня) Тогда
				ЭлементМассиваДней = ЭлементМ;
				Прервать;
			КонецЕсли;	
		КонецЦикла;			
		Если ЭлементМассиваДней <> Неопределено Тогда
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив;
			МассивПериодов.Добавить(ЭлементМассиваДней);	
			СписокВермениРаботы  = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, 30);	
			
			Для Каждого ЭлементС ИЗ СписокВермениРаботы Цикл
				Элементы.ИнтервалыВремениНачало.СписокВыбора.Добавить(ЭлементС.Значение, ЭлементС.Представление);
				Элементы.ИнтервалыВремениКонец.СписокВыбора.Добавить(ЭлементС.Значение, ЭлементС.Представление);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение таблицы интервалов
	Если ЗначениеЗаполнено(ИнтервалыРаботы) Тогда
		Для Каждого СтрокаС ИЗ ИнтервалыРаботы Цикл
			НоваяСтрока                  = ИнтервалыВремени.Добавить();
			НоваяСтрока.Номер            = ИнтервалыВремени.Количество();
			НоваяСтрока.НачалоРаботы     = СтрокаС.Значение.НачалоРаботы;
			НоваяСтрока.ОкончаниеРаботы  = СтрокаС.Значение.ОкончаниеРаботы;
		КонецЦикла;
	КонецЕсли;
	
	// Получаем список закешированных интервалов врмени и строим меню выбора
	СоздатьДинамическиеЭлементыспискаМенюШаблонов();
	
КонецПроцедуры

&НаКлиенте
// Обработчик при закрытии формы
// 
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокШаблоновБылИзменен = Истина Тогда
		Оповестить("ПриИзмененииШаблоновИнтерваловВремени",,ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещения формы
// 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПриИзмененииШаблоновИнтерваловВремени" И Источник <> ЭтаФорма Тогда
		// Перезаполнить кешь шаблонов и пересоздать динамические элементы
		СоздатьДинамическиеЭлементыспискаМенюШаблонов();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнтервалыВремени

&НаКлиенте
// Обработчик при начале редактирвоания таблицы
// 
Процедура ИнтервалыВремениПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.ИнтервалыВремени.ТекущиеДанные <> Неопределено Тогда
		Если НоваяСтрока = Истина Тогда
			Элементы.ИнтервалыВремени.ТекущиеДанные.Номер = ИнтервалыВремени.Количество();
		Иначе
			ВремяНачалоПред    = Элементы.ИнтервалыВремени.ТекущиеДанные.НачалоРаботы;
			ВремяОкончанияПред = Элементы.ИнтервалыВремени.ТекущиеДанные.ОкончаниеРаботы;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Перед окончанием редактирвоания
// 
Процедура ИнтервалыВремениПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ИнтервалыВремени.ТекущиеДанные;
	// Проверить возможность использования заданных интервалов
	Если ТекущиеДанные <> Неопределено И ОтменаРедактирования = Ложь Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботы) Тогда
			ПоказатьПредупреждение(,"Укажите время начала рабочего интервала!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботы) Тогда
			ПоказатьПредупреждение(,"Укажите время окончания рабочего интервала!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		Если ТекущиеДанные.НачалоРаботы > ТекущиеДанные.ОкончаниеРаботы Тогда
			ПоказатьПредупреждение(,"Время начала работы не может быть больше времени окончания работы!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
				
		Для Каждого СтрокаТ ИЗ ИнтервалыВремени Цикл
			
			Если СтрокаТ.ПолучитьИдентификатор() <> ТекущиеДанные.ПолучитьИдентификатор() Тогда
				Если ТекущиеДанные.НачалоРаботы >= СтрокаТ.НачалоРаботы И ТекущиеДанные.НачалоРаботы <= СтрокаТ.ОкончаниеРаботы Тогда
					ПоказатьПредупреждение(,"Обнаружено пересечение времени!");
					Отказ = Истина;		
					Прервать;
				КонецЕсли;
				Если ТекущиеДанные.ОкончаниеРаботы >= СтрокаТ.НачалоРаботы И ТекущиеДанные.ОкончаниеРаботы <= СтрокаТ.ОкончаниеРаботы Тогда
					ПоказатьПредупреждение(,"Обнаружено пересечение времени!");
					Отказ = Истина;	
					Прервать;
			    КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	// При флаге отмены редактирования сбросить данные строки, до начала редактирования	
	ИначеЕсли ТекущиеДанные <> Неопределено И ОтменаРедактирования = Истина Тогда
		ТекущиеДанные.НачалоРаботы    = ВремяНачалоПред;
		ТекущиеДанные.ОкончаниеРаботы = ВремяОкончанияПред;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки выбора и закрытия формы
Процедура КомандаВыбрать(Команда)
	
	РезВыбора = Неопределено;
	Если ИнтервалыВремени.Количество() > 0 Тогда
		// Подготовка результата подбора
		РезВыбора = Новый СписокЗначений;	
		Для А = 0 По ИнтервалыВремени.Количество() - 1 Цикл	
			Если ЗначениеЗаполнено(ИнтервалыВремени[А].НачалоРаботы) И ЗначениеЗаполнено(ИнтервалыВремени[А].ОкончаниеРаботы) Тогда
				РезВыбора.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", ИнтервалыВремени[А].НачалоРаботы, ИнтервалыВремени[А].ОкончаниеРаботы));
			КонецЕсли;
		КонецЦикла;
		
		// Сохраняем в кеш подобранный интервал времени
		СохранитьКешШаблонов();
	КонецЕсли;
		
	ЭтаФорма.Закрыть(РезВыбора);
	
КонецПроцедуры

&НаКлиенте
// Отмена редактирования и закрытие формы
Процедура КомандаОтмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия кнопки контекстного меню шаблонов
Процедура КомандаДинамическогоМенюШаблонов(Команда)
	
	НомерЭл          = Число(СтрЗаменить(Команда.Имя,"ШаблонИнтерваловВремени_",""));	
	СписокИнтервалов = СписокШаблонов[НомерЭл].Значение;
	ИнтервалыВремени.Очистить();
	Для Каждого ЭлементС ИЗ СписокИнтервалов Цикл
		НоваяСтрока                 = ИнтервалыВремени.Добавить();
		НоваяСтрока.Номер           = ИнтервалыВремени.Количество();
		НоваяСтрока.НачалоРаботы    = ЭлементС.Значение.НачалоРаботы;
		НоваяСтрока.ОкончаниеРаботы = ЭлементС.Значение.ОкончаниеРаботы;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ШаблоныИнтерваловВремени

&НаСервере
// Создание динамических элементов списка
// 
Процедура СоздатьДинамическиеЭлементыспискаМенюШаблонов()
	
	// Получаем список закешированных интервалов врмени и строим меню выбора
	ЗакешированныеЗначения = ХранилищеСистемныхНастроек.Загрузить("КешированиеВводимыхЗначений", "ИнтервалыВремени");
	Если ЗакешированныеЗначения <> Неопределено Тогда
		Если ЗакешированныеЗначения <> Неопределено Тогда
			СписокШаблонов.ЗагрузитьЗначения(ЗакешированныеЗначения);
		КонецЕсли;
	КонецЕсли;
	
	// Предварительно удалить динамические элементы и команды
	Счетчик = 0;
	Пока Истина Цикл
		НайденныйЭлемент = Элементы.Найти("ШаблонИнтерваловВремени_" + Счетчик);
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.Удалить(НайденныйЭлемент);	
		Иначе
			// Полгаем что мы дошли до последнего элемента
			Прервать;
		КонецЕсли;
		НайденнаяКоманда = Команды.Найти("ШаблонИнтерваловВремени_" + Счетчик);
		Если НайденнаяКоманда <> Неопределено Тогда
			Команды.Удалить(НайденнаяКоманда);	
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;	
	
	// Создаем новый динамические элементы и команды
	Для А = 0 По СписокШаблонов.Количество() - 1 Цикл
		Если А = 10 Тогда
			Прервать;
		КонецЕсли;	
		Если СписокШаблонов[А].Значение = неопределено ТОгда
			Продолжить;
		КонецЕсли;
		
		КомандаФормы          = Команды.Добавить("ШаблонИнтерваловВремени_" + А);
		КомандаФормы.Действие = "КомандаДинамическогоМенюШаблонов";
				
		КнопкаШаблона            = Элементы.Вставить("ШаблонИнтерваловВремени_" + А
		, Тип("КнопкаФормы")
		, Элементы.ИнтервалыВремениГруппаШаблоны
		, Элементы.ИнтервалыВремениКомандаРедактироватьШаблоны);
		
		КнопкаШаблона.ИмяКоманды = "ШаблонИнтерваловВремени_" + А;
		КнопкаШаблона.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
		КнопкаШаблона.Заголовок  = Обработки.ГрафикРаботыСотрудников.ПредставлениеИнтервалавремени(СписокШаблонов[А].Значение);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
// Открыть форму редактирования шаблонов
// 
Процедура КомандаРедактироватьШаблоны(Команда, ДопПараметр = Неопределено) Экспорт
	
	Если ТипЗнч(ДопПараметр) = Тип("Структура")
		И ДопПараметр.ОбработкаРезВыбора = Истина Тогда
		
		ВыбранноеЗначение = Команда;
		Если ВыбранноеЗначение <> Неопределено Тогда
			ИнтервалыВремени.Очистить();
			Для Каждого ЭлементС ИЗ ВыбранноеЗначение Цикл
				НоваяСтрока                 = ИнтервалыВремени.Добавить();
				НоваяСтрока.Номер           = ИнтервалыВремени.Количество();
				НоваяСтрока.НачалоРаботы    = ЭлементС.Значение.НачалоРаботы;
				НоваяСтрока.ОкончаниеРаботы = ЭлементС.Значение.ОкончаниеРаботы;
			КонецЦикла;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("КомандаРедактироватьШаблоны", ЭтаФорма, Новый Структура("ОбработкаРезВыбора", Истина));
	ОткрытьФорму("Обработка.ГрафикРаботыСотрудников.Форма.ФормаСпискаШаблоновВремени",, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
// Сохранить новые шаблоны
// 
Процедура СохранитьКешШаблонов()
	
	// Сравнение текущего набора интевалов со списком закешированных шаблонов
	НайденоРавенство = Ложь;
	Для Каждого ЭлементС ИЗ СписокШаблонов Цикл
		Если ЭлементС.Значение = Неопределено тогда
			Продолжить;
		КОнецЕсли;
		Если ЭлементС.Значение.Количество() = ИнтервалыВремени.Количество() Тогда		
			Для А = 0 По ЭлементС.Значение.Количество() - 1 Цикл
				РабочееВремя = ЭлементС.Значение[А].Значение;
				Если РабочееВремя.НачалоРаботы = ИнтервалыВремени[А].НачалоРаботы
					И РабочееВремя.ОкончаниеРаботы = ИнтервалыВремени[А].ОкончаниеРаботы Тогда
					НайденоРавенство = Истина;
				Иначе
					НайденоРавенство = Ложь;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		Если НайденоРавенство = Истина Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если этот набор не встречается в шаблонах добавляем его 
	Если НайденоРавенство = Ложь Тогда
		
		СписокНовогоШаблона = Новый СписокЗначений;	
		Для А = 0 По ИнтервалыВремени.Количество() - 1 Цикл	
			Если ЗначениеЗаполнено(ИнтервалыВремени[А].НачалоРаботы) И ЗначениеЗаполнено(ИнтервалыВремени[А].ОкончаниеРаботы) Тогда
				СписокНовогоШаблона.Добавить(Новый Структура("НачалоРаботы, ОкончаниеРаботы", ИнтервалыВремени[А].НачалоРаботы, ИнтервалыВремени[А].ОкончаниеРаботы));
			КонецЕсли;
		КонецЦикла;
		
		СписокШаблонов.Добавить(СписокНовогоШаблона);
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Сохраняем список шаблонов
		ХранилищеСистемныхНастроек.Сохранить("КешированиеВводимыхЗначений", "ИнтервалыВремени", СписокШаблонов.ВыгрузитьЗначения());
		СписокШаблоновБылИзменен = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыВремениНачалоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИнтервалыВремени.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;

	ТекущаяСтрока = ТекущиеДанные.Номер;
	Если ТекущаяСтрока > 1 Тогда
		
		ПредыдущаяСтрока    = ИнтервалыВремени[ТекущаяСтрока - 2];
		НачинаяСВремени     = ПредыдущаяСтрока.ОкончаниеРаботы + 30;
		
		ЭлементМассиваДней = Неопределено;
		Для Каждого ЭлементМ Из ВремяРаботыСтруктурнойЕдиницы Цикл
			Если ДеньНедели(ЭлементМ.ДеньНедели) = ДеньНедели(ДатаДня) Тогда
				ЭлементМассиваДней = ЭлементМ;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Если ЭлементМассиваДней <> Неопределено Тогда
			// Заполнить список интервалов времени
			МассивПериодов = Новый Массив;
			МассивПериодов.Добавить(ЭлементМассиваДней);	
			СписокВермениРаботы  = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, 30,, НачинаяСВремени);	
			Элементы.ИнтервалыВремениНачало.СписокВыбора.Очистить();
			Элементы.ИнтервалыВремениКонец.СписокВыбора.Очистить();

			Для Каждого ЭлементС Из СписокВермениРаботы Цикл
				Элементы.ИнтервалыВремениНачало.СписокВыбора.Добавить(ЭлементС.Значение, ЭлементС.Представление);
				Элементы.ИнтервалыВремениКонец.СписокВыбора.Добавить(ЭлементС.Значение, ЭлементС.Представление);
			КонецЦикла;
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
